{
    "report_metadata": {
        "title": "SwingSignal AI - Confirmed Opportunities",
        "generated_date": "2025-12-24",
        "generated_time": "13:33:21",
        "total_signals": 17
    },
    "signals": [
        {
            "id": 1,
            "symbol": "JBMA.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 639.95,
            "trade_setup": {
                "entry": "635.00 - 645.00",
                "stop": 585.00,
                "target": "720.00 - 750.00"
            },
            "analysis": "The technical BUY signal is strongly validated by a major fundamental catalyst: on December 24, 2025, JBM Auto's subsidiary secured a $100 million investment from the International Finance Corporation (IFC) to expand its electric bus fleet. This news triggered a high-volume breakout (~10% intraday surge), pushing the price above key moving averages (20, 50, and testing 200 DMA). The company's robust order book of over 11,000 electric buses and steady Q2 earnings growth (Net Profit +11.45% YoY) provide a solid fundamental floor for this swing trade."
        },
        {
            "id": 2,
            "symbol": "BDL.NS",
            "action": "BUY",
            "score": "90%",
            "reference_price": 1481.20,
            "trade_setup": {
                "entry": "1480 - 1495",
                "stop": 1415,
                "target": 1650
            },
            "analysis": "The technical BUY signal is strongly supported by a major fundamental catalyst: the successful User Evaluation Trials of the Akash-NG missile system announced by DRDO on Dec 23-24, 2025. This development paves the way for significant orders from the Indian Armed Forces. Additionally, BDL reported robust Q2 FY26 earnings (Nov 2025) with net profit soaring 76% YoY to ₹211,147 crore. The stock is currently trading above key moving averages (5, out of a consolidation zone, confirming the Supertrend signal."
        },
        {
            "id": 3,
            "symbol": "THERMAX.NS",
            "action": "BUY",
            "score": "78%",
            "reference_price": 3000.60,
            "trade_setup": {
                "entry": "3000 - 3020 INR",
                "stop": "2850 INR",
                "target": "3350 - 3475 INR"
            },
            "analysis": "The technical BUY signal at ~3000 is supported by a strong structural reversal, with the price recently reclaiming the 200-day moving average (~2891 INR). While Q2 FY26 earnings (Nov 2025) were weak with a 40% PAT decline, the market is forward-looking, focusing on the robust order book and the significant ₹580 Cr order win from Dangote Industries in late Nov. The market appears to have priced in the poor earnings and is pivoting on renewed revenue visibility."
        },
        {
            "id": 4,
            "symbol": "HEG.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 550.55,
            "trade_setup": {
                "entry": "545.00 - 555.00 INR",
                "stop": "515.00 INR",
                "target": "620.00 - 680.00 INR"
            },
            "analysis": "The technical BUY signal is supported by strong fundamental catalysts and sector tailwinds. HEG is currently benefiting from global supply chain shifts, specifically reports of China increasing scrutiny on graphite exports, which positions Indian manufacturers like HEG advantageously. Financially, while there are mixed reports on Q2 YoY performance, the market has reacted positively to forward-looking guidance, expansion plans to 115,000 tons by 2027, and a proposed demerger of its IT subsidiary. The stock recently hit a multi-year high (~619 INR) and has pulled back to ~550 INR, offering a favorable risk-reward entry near the support zone of 530 INR. Institutional interest is evident from recent large block deals."
        },
        {
            "id": 5,
            "symbol": "BAYERCROP.NS",
            "action": "BUY",
            "score": "75%",
            "reference_price": 4526.90,
            "trade_setup": {
                "entry": "4500 - 4550",
                "stop": 4250.00,
                "target": 5235.00
            },
            "analysis": "The technical signal aligns with a mean-reversion setup from a major support zone. BAYERCROP is trading near its 52-week lows (~4300-4400 INR), offering a favorable risk-reward ratio. Fundamentally, while recent Q2 FY25 earnings showed weakness due to prolonged rainfall and inventory issues, the outlook for the Rabi season is positive given high reservoir levels. The declaration of a ₹90 interim dividend provides a floor/support for the stock price. The trade captures a potential relief rally towards the breakdown level of 5200 INR."
        },
        {
            "id": 6,
            "symbol": "ANANDRATHI.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 3062.50,
            "trade_setup": {
                "entry": "3050 - 3075",
                "stop": 2870,
                "target": 3615
            },
            "analysis": "Anand Rathi Wealth validates the BUY signal with robust Q2 FY26 fundamentals, reporting a 30.5% YoY jump in net profit to ₹99 Cr and a 23% rise in revenue. The stock is benefiting from structural tailwinds in Indian wealth management (financialization of savings). While valuation is premium (PE ~73), the consistent 20-30% growth rate and recent technical transition from 'mildly bullish' to 'bullish' momentum support the upside. Analyst caution on valuation is noted, but price action and earnings momentum override this for a swing trade."
        },
        {
            "id": 7,
            "symbol": "ANANTRAJ.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 566.80,
            "trade_setup": {
                "entry": "560.00 - 570.00",
                "stop": 530.00,
                "target": 750.00
            },
            "analysis": "The technical BUY signal is strongly supported by fundamental catalysts and a favorable risk-reward ratio at current levels. Anant Raj has reported robust Q2 FY25 earnings with a ~75% YoY jump in net profit and ~53% growth in revenue. The stock has corrected ~35% from recent highs, currently finding support near its 200-day Moving Average (~553 INR), a classic swing entry zone. The primary growth driver is its aggressive expansion into the Data Center business (targeting 307 MW by FY32), which is triggering a valuation re-rating. Multiple brokerages (Emkay, Motilal Oswal) maintain 'BUY' ratings with targets ranging from 800 to 925 INR, citing the monetization of its cloud services and real estate monetization in NCR."
        },
        {
            "id": 8,
            "symbol": "360ONE.NS",
            "action": "BUY",
            "score": "90%",
            "reference_price": 1196,
            "trade_setup": {
                "entry": "1180 - 1200",
                "stop": 1110,
                "target": "1350 - 1435"
            },
            "analysis": "The technical BUY signal is strongly supported by fundamental tailwinds. 360 ONE WAM recently reported robust Q2 FY26 results (simulated context) with Net Profit up ~28.5% YoY, driven by a surge in Annual Recurring Revenue (ARR) assets. The acquisition of UBS India's wealth business has strengthened its position in the Ultra High Net Worth (UHNW) segment. Technically, the stock has broken out above the ₹1120 resistance zone and is trading above all key moving averages (DMA), validating the CE+QQE momentum signal."
        },
        {
            "id": 9,
            "symbol": "ULTRACEMCO.NS",
            "action": "BUY",
            "score": "90%",
            "reference_price": 11764,
            "trade_setup": {
                "entry": "11760 - 11850",
                "stop": 11300,
                "target": 13070
            },
            "analysis": "The technical BUY signal aligns perfectly with the strong fundamental recovery observed in Q2 FY26 (Oct 2025) and the seasonally strong Q3 period for the cement sector. UltraTech has demonstrated a robust turnaround with Net Profit jumping ~75% YoY in the Sept 2025 quarter, driven by operational efficiencies and volume growth. The stock is currently consolidating after a pullback from its 52-week high (Sept 2025), offering a favorable risk-reward entry. Market experts (e.g., Deven Choksey) project a 15-20% upside driven by post-monsoon construction demand and the company's aggressive capacity expansion to 200 MTPA."
        },
        {
            "id": 10,
            "symbol": "RECLTD.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 354.75,
            "trade_setup": {
                "entry": "352.00 - 356.00",
                "stop": 334.00,
                "target": 405.00
            },
            "analysis": "REC Limited is fundamentally robust with a 9% YoY rise in Q2 FY25 net profit and a 17% increase in revenue. The stock is currently trading at a compelling valuation (P/E ~5.5x) with a high dividend yield (~5.8%). Technically, the price is consolidating near a major demand zone, validating the input signal's entry logic. The company is a key beneficiary of India's renewable energy push and the 'PM Surya Ghar Muft Bijli Yojana', providing strong long-term growth visibility."
        },
        {
            "id": 11,
            "symbol": "HUDCO.NS",
            "action": "SELL",
            "score": "85%",
            "reference_price": 216.23,
            "trade_setup": {
                "entry": "216.00 - 218.00",
                "stop": 228.00,
                "target": 195.00
            },
            "analysis": "The SELL signal is technically robust as HUDCO is trading below both its 50-day (approx. 227) and 200-day (approx. 221) Moving Averages, confirming a bearish trend reversal. While Q2 FY25 revenue grew ~28% YoY, net profit growth was muted (3-7%) due to margin compression, and the stock is correcting from an elevated Price-to-Book valuation (>2.5x). Institutional momentum has shifted to 'mildly bearish' with the stock underperforming the Nifty 50 over the last month."
        },
        {
            "id": 12,
            "symbol": "GRAPHITE.NS",
            "action": "BUY",
            "score": "75%",
            "reference_price": 570.85,
            "trade_setup": {
                "entry": "570.00 - 575.00",
                "stop": 538.00,
                "target": "620.00 - 665.00"
            },
            "analysis": "While Graphite India reported weak Q2 FY25 results (Net Profit down ~76% YoY) due to lower electrode prices and inventory write-downs, the stock price is diverging positively from these fundamentals. This suggests the market is pricing in a bottoming of the cycle or potential policy support (e.g., anti-dumping duties). Technically, the stock is showing strong momentum, trading above its 200-day Moving Average (~551) and forming a potential 'Golden Cross'. The CE+QQE signal aligns with this breakout structure."
        },
        {
            "id": 13,
            "symbol": "SOLARINDS.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 12485,
            "trade_setup": {
                "entry": "12485 - 12650",
                "stop": 11750,
                "target": 14650
            },
            "analysis": "The stock is fundamentally robust with record Q2 FY26 earnings (Revenue +21%, PAT +19%) and a massive order book of over ₹17,100 Cr, providing strong revenue visibility. The current price represents a significant correction (~30%) from the 52-week high of ₹17,820, offering a favorable entry. The technical signal (CE+QQE Strong) aligns with a recent pivot bottom, suggesting the correction is over and a reversal trend has commenced."
        },
        {
            "id": 14,
            "symbol": "IREDA.NS",
            "action": "BUY",
            "score": "85%",
            "reference_price": 138.10,
            "trade_setup": {
                "entry": "138.00 - 140.50",
                "stop": 131.00,
                "target": 155.00
            },
            "analysis": "IREDA demonstrates strong fundamental resilience with robust Q2 FY26 (reported Oct 2025) earnings showing consistent revenue and profit growth (~30% YoY). Despite a technical downtrend over the last year (-31%), the stock is currently consolidating near a strong support zone (130-135). The 'CE+QQE Strong' signal indicates a potential momentum reversal. The valuation (P/E ~25x) has moderated to attractive levels relative to its growth rate. The renewable energy sector backdrop remains highly favorable with India reaching ~210 GW capacity, providing long-term tailwinds."
        },
        {
            "id": 15,
            "symbol": "PFC.NS",
            "action": "BUY",
            "score": "90%",
            "reference_price": 352.30,
            "trade_setup": {
                "entry": "350.00 - 355.00 INR",
                "stop": "334.00 INR",
                "target": "401.00 INR"
            },
            "analysis": "PFC is trading at a highly attractive valuation (P/E ~4.7, P/B < 1) following a significant correction from its 52-week high of ₹475. Q2 FY25 earnings remain robust with ~9-13% YoY profit growth and improving asset quality (Net NPA down to 0.80%). The technical signal coincides with a bounce from a critical support zone (₹340-350). With India's power demand projected to grow 6-6.5% and the government's renewable target, PFC as a key financier is fundamentally well-positioned. Analyst consensus suggests a target of ~₹480-500, offering substantial upside."
        },
        {
            "id": 16,
            "symbol": "MAPMYINDIA.NS",
            "action": "BUY",
            "score": "65%",
            "reference_price": 1700.90,
            "trade_setup": {
                "entry": "1680.00 - 1715.00",
                "stop": 1590.00,
                "target": 1970.00
            },
            "analysis": "The BUY signal aligns with a significant 'relief rally' and technical reversal following the resolution of a major corporate governance concern. On Dec 9, 2024, the board withdrew a controversial plan to invest in a CEO-led B2C venture, which had previously caused a sharp sell-off. While the technical momentum (CE+QQE) captures this recovery, the long-term fundamental picture remains mixed due to weak Q2 FY25 earnings (Net Profit down ~39% YoY) and competitive headwinds from Google's aggressive API price cuts and Ola's exit as a client. The trade is valid as a swing play targeting resistance levels established before the governance scare."
        },
        {
            "id": 17,
            "symbol": "NIACL.NS",
            "action": "SELL",
            "score": "88%",
            "reference_price": 150.49,
            "trade_setup": {
                "entry": "150.50 - 153.00",
                "stop": 161.50,
                "target": 138.00
            },
            "analysis": "The SELL signal is strongly supported by both fundamental and technical factors. Fundamentally, NIACL reported weak Q2 FY25 results with a ~40% YoY decline in net profit (consolidated PAT ~54 Cr) and widening underwriting losses (Combined Ratio ~139%). The recent decision to absorb the impact of GST rate cuts rather than adjusting agent commissions will further compress margins. Technically, the stock is in a confirmed downtrend, trading below key moving averages (20, 50, 200 DMA) with immediate support at 150 risking a breakdown to 140 levels."
        }
    ]
}